//Задача 2: Напишите программу, которая на вход принимает два числа
// и выдаёт, какое число большее, а какое меньшее.

// Console.WriteLine("Введите первое число");
// string? a = Console.ReadLine();
// Console.WriteLine("Введите второе число");
// string? b = Console.ReadLine();
// int aa = Convert.ToInt32(a);
// int bb = Convert.ToInt32(b);
// if (aa > bb)
// {
//    Console.Write("Наибольшее число: ");
//    Console.WriteLine(a); 
// }
// else
// {
//    Console.Write("Наибольшее число: ");
//    Console.WriteLine(b);

// }
//____________________________________________________

// Задача 1. Напишите программу, которая на вход принимает одно число (N), 
// а на выходе показывает все целые числа в промежутке от -N до N.

// Console.WriteLine("Введите число: ");
// int m = Convert.ToInt32(Console.ReadLine());

// for (int i = -m; i <= m; i++)
//     Console.WriteLine(i);

//___________________________________________________________

//Задача. Напишите программу, которая принимает на вход трёхзначное число
// и на выходе показывает последнюю цифру этого числа.

// Console.WriteLine("Введите 3-х значное число: ");
// int n = Convert.ToInt32(Console.ReadLine());

// int m = n /100 % 10;

// Console.WriteLine(m);
//________________________________________________________

